TYRANO.kag.dc = {
  ...TYRANO.kag.dc,
  stickerData: () => [
    {
      file: '1',
      name: '酥脆的海带',
      desc: '从萨菲尔出浴后的汤汁中捞出的干海带。即便湿漉漉的，也依旧酥脆。',
    },
    {
      file: '2',
      name: '法式面包',
      desc: '佩恩最爱的食物！即便被压碎或烤焦，依然美味。',
    },
    {
      file: '3',
      name: '阿莫阿莫的海兔触手',
      desc: '还在扭动着的触手。听说阿莫阿莫用这个来捕获猎物。',
    },
    {
      file: '4',
      name: '杂鱼海天使',
      desc: '阿莫阿莫的使魔，是个外形酷似海天使的小悪魔。能变透明。',
    },
    {
      file: '5',
      name: '超大栓剂',
      desc: '爱丽丝手工制作而成。插入后，会迅速转化为绿色的史莱姆。',
    },
    {
      file: '6',
      name: '红色的饮用药',
      desc: '爱丽丝手工制作而成。服用后，立刻让人感到头晕并陷入混乱状态。',
    },
    {
      file: '7',
      name: '小黄书',
      desc: '递给阿尔玛斯的小黄书。这究竟是召唤师的私人物品，还是借来的呢……',
    },
    {
      file: '8',
      name: '爱伦的叉子',
      desc: '爱伦的武器。传言他一旦愤怒，就会用这把叉子把敌人刺个透。',
    },
    {
      file: '9',
      name: '魔术帽',
      desc: '给艾美洛德佩戴的帽子。戴上后，似乎能更好地施展魔法。',
    },
    {
      file: '10',
      name: '狼假面',
      desc: '加乌洛斯的面具。戴上后，似乎能更好地运用魔眼。',
    },
    {
      file: '11',
      name: '蒲公英蛋包饭',
      desc: '艾美洛德亲自下厨。蛋液松软滑嫩，味道美好♥',
    },
    {
      file: '12',
      name: '蛋寿司',
      desc: '艾美洛德亲自下厨。饭粒温热，鸡蛋松软，吃上一口便令人陶醉♥',
    },
    {
      file: '13',
      name: '南瓜饭团',
      desc: '艾美洛德亲自下厨。可惜番茄酱不够！再多放点调料！',
    },
    {
      file: '14',
      name: '骷髅寿司',
      desc: '艾美洛德亲自下厨。没有添加任何食材，纯粹的米饭寿司！！',
    },
    {
      file: '15',
      name: '切好的水果',
      desc: '萨菲尔切好的水果。富含魔力，口感Q弹美味。',
    },
    {
      file: '16',
      name: '树莓派',
      desc: '德比伦最喜欢的食物。酸甜可口，味道美妙♥',
    },
    {
      file: '17',
      name: '阿布拉卡达布拉面',
      desc: '德比伦最喜欢的食物。加满大蒜，味道十足！',
    },
    {
      file: '18',
      name: '电气汽水',
      desc: '嘎库最喜欢的饮品。清爽的气泡味！能量效率极佳！',
    },
    {
      file: '19',
      name: '魔石式充电器',
      desc: '老式充电器，需要在嘎库体内先行转换一次。本质上其实是魔石。',
    },
    {
      file: '20',
      name: '绿色史莱姆',
      desc: '冰冷黏腻的触感，柯妮非常讨厌。会发出咕啾咕啾的声音。',
    },
    {
      file: '21',
      name: '香蕉皮',
      desc: '让柯妮摔倒的物品。虽然只是果皮，但也不可小觑。',
    },
    {
      file: '22',
      name: '红边眼镜',
      desc: '柯妮重要的眼镜。没有了它就如同废人一般。',
    },
    {
      file: '23',
      name: '魔法警察帽',
      desc: '柯妮佩戴的帽子。戴上它你也可以成为巡警！',
    },
    {
      file: '24',
      name: '产自茄子原产地的茄子',
      desc: '狐白讨厌的食物。除了棉花糖和年糕，其它都无法接受莫！',
    },
    {
      file: '25',
      name: '绿色的叶子',
      desc: '从狐白处得到的叶子。放到头上就能够变身为魔物莫尼尼的样子。',
    },
    {
      file: '26',
      name: '复制伦',
      desc: '杰科特制作的模型。熟知德比伦的弱点。',
    },
    {
      file: '27',
      name: '镰马踢',
      desc: '茱艾莉萍克的必杀技。挥动镰刀般的动作，留下惊人的残像。',
    },
    {
      file: '28',
      name: '毛',
      desc: '德比伦的毛毛。尾巴蓬松柔软！胯下扎手且带有独特气味。',
    },
    {
      file: '29',
      name: '成绩单',
      desc: '向廷格炫耀的东西。第一学年就能掌握咒术学。',
    },
    {
      file: '30',
      name: '魔头鹰霍洛儿',
      desc: '奈泽尔饲养的魔头鹰。会发出「MaHo～」一般的叫声。',
    },
    {
      file: '31',
      name: '催眠振子',
      desc: '潘普提操控的催眠振子。中招后，会逐渐进入软绵绵的状态。',
    },
    {
      file: '32',
      name: '星星',
      desc: '咪蒂尔擅长的魔法。散发出耀眼的光芒。',
    },
    {
      file: '33',
      name: '宝石',
      desc: '给穆穆看的宝石假象。是真是假一眼就能看穿！',
    },
    {
      file: '34',
      name: '红酒',
      desc: '从鲁比处搞来的陈年红酒，味道极好！！！！！',
    },
    {
      file: '35',
      name: '红酒酒瓶',
      desc: '玛尔斯借酒消愁时喝的酒。酒精度高，喝一口秒醉。',
    },
    {
      file: '36',
      name: '龙魂法杖',
      desc: '拉弥亚的法杖。上面嵌了一颗封印过龙的宝玉。',
    },
    {
      file: '37',
      name: '扇贝',
      desc: '露娜喜欢的高级食材。肉质厚实，适合用来做贝类炒菜！',
    },
    {
      file: '38',
      name: '月之杖',
      desc: '鲁比的法杖。可以变换成镰刀形态，方便近战与远程攻击。',
    },
    {
      file: '39',
      name: '鱼可可',
      desc: '黏在鲁比身边的蝙蝠小恶魔。擅长拍马屁，雌性。',
    },
    {
      file: '40',
      name: '杂斯',
      desc: '黏在鲁比身边的蝙蝠小恶魔。不擅长拍马屁，雄性。',
    },
    {
      file: '41',
      name: '嘴巴（大笑）',
      desc: '推荐召唤师使用，可呈现笑容！',
    },
    {
      file: '42',
      name: '鼻血',
      desc: '想让人物表达兴奋状态时使用！',
    },
    {
      file: '43',
      name: '汗',
      desc: '想让人物表达焦急状态时使用！',
    },
    {
      file: '44',
      name: '对话框',
      desc: '与其他符号组合使用效果更佳。',
    },
    {
      file: '45',
      name: '愤怒标志',
      desc: '想让人物表达愤怒状态时使用！',
    },
    {
      file: '46',
      name: '喧闹标志',
      desc: '想要营造热闹氛围时使用！',
    },
    {
      file: '47',
      name: '疑问标志',
      desc: '想展现神秘氛围或疑惑状态时使用！',
    },
    {
      file: '48',
      name: '震惊标志',
      desc: '想让人物表达震惊状态时使用！',
    },
    {
      file: '49',
      name: '音符标志',
      desc: '想让人物表达心情愉悦时使用！',
    },
    {
      file: '50',
      name: '笑声标志',
      desc: '想撩拨或挑衅时使用！',
    },
    {
      file: '51',
      name: '蝴蝶结',
      desc: '为了糊弄阿尔玛斯，而系在德比伦身上的粉色蝴蝶结。',
    },
    {
      file: '52',
      name: '脸红',
      desc: '想让人物表达害羞状态时使用！',
    },
    {
      file: '53',
      name: '像素爱心',
      desc: '丽丽卡专用的饰品。闪闪亮亮，超级可爱！',
    },
    {
      file: '54',
      name: '闪闪发光',
      desc: '丽丽卡专用的饰品。随便撒开就能瞬间点亮全场！',
    },
    {
      file: '55',
      name: '情绪高涨～↑',
      desc: '丽丽卡专用的饰品。状态MAX！',
    },
    {
      file: '56',
      name: '肉球',
      desc: '经典肉垫印章，萌趣十足！',
    },
    {
      file: '57',
      name: 'LOVE',
      desc: '丽丽卡专用的饰品。Q弹爱心，爆量加持！',
    },
    {
      file: '58',
      name: '德比伦颜文字：得意脸',
      desc: '德比伦的表情符号，稍微让人不爽的表情。',
    },
    {
      file: '59',
      name: '德比伦颜文字：惊讶脸',
      desc: '德比伦的表情符号。用来表达惊讶时使用。',
    },
    {
      file: '60',
      name: '德比伦颜文字：思考脸',
      desc: '德比伦的表情符号。用来表达思考时使用。',
    },
    {
      file: '61',
      name: '长颈鹿表情符号：悲伤',
      desc: '已经是超越小哭超越爆泪的超级伤心SAVANNA啦～',
    },
    {
      file: '62',
      name: '恶魔之翼',
      desc: '给佩恩按上的恶魔翅膀。不过他似乎不喜欢。',
    },
    {
      file: '63',
      name: '天使之翼',
      desc: '给佩恩按上的天使翅膀。他似乎很喜欢。',
    },
    {
      file: '64',
      name: '爱心',
      desc: '想让人物表达心动感时使用！',
    },
    {
      file: '65',
      name: '玛奇的照相机',
      desc: '玛奇的专用照相机。用这个来拍摄证据吧！',
    },
    {
      file: '66',
      name: '薄荷蛋糕',
      desc: '由薄荷亲手制作的薄荷蛋糕。薄荷与巧克力占比八二开，口感清爽宜人。',
    },
    {
      file: '67',
      name: '催眠薄荷',
      desc: '薄荷小姐偷偷种植的薄荷。吃过一次就停不下来！',
    },
    {
      file: '68',
      name: '叉叉兔',
      desc: '阿莫阿莫喜欢的布偶。奇怪的是上面有个洞。',
    },
    {
      file: '69',
      name: '梦魔眼罩',
      desc: '阿莫阿莫常用的眼罩。据说戴上能做美梦……',
    },
    {
      file: '70',
      name: '灵魂收割者',
      desc: '哈德斯塔的大镰刀。能无痛收割灵魂。',
    },
    {
      file: '71',
      name: '兔女郎头箍',
      desc: '给德比伦戴上的兔耳发箍。这种性感能让主人欣喜若狂！',
    },
    {
      file: '72',
      name: '女仆发箍',
      desc: '给德比伦戴上的女仆发箍。这种可爱能让主人欣喜若狂！',
    },
    {
      file: '73',
      name: '迷你丝带',
      desc: '给哈德斯塔系上的丝带。随手加到哪里就可爱爆棚！',
    },
    {
      file: '74',
      name: '格拉迪乌斯之枪',
      desc: '别西卜的长矛。偶尔当叉子来使用……',
    },
    {
      file: '75',
      name: '布布茶泡饭',
      desc: '别西卜喜欢的食物。「来碗布布茶泡饭？」言下之意为「你差不多该回去了」。',
    },
    {
      file: '76',
      name: '咒语蝴蝶结',
      desc: '纳扎尔的刘海上的蝴蝶结。只有说出真心话方能解开。',
    },
    {
      file: '77',
      name: '杂鱼龙兵',
      desc: 'D・Red的手下。一眼望去，就能看出信仰有多么虔诚了。',
    },
    {
      file: '78',
      name: '铃铛',
      desc: '铃兰之铃。只需摇响，库皮亚多艾露便会随时赶来。',
    },
    {
      file: '79',
      name: '魔笛',
      desc: '米迦勒赐予的魔笛。吹奏时可小幅恢复魔力。',
    },
    {
      file: '80',
      name: '格子旗',
      desc: '米迦勒赐予的旗帜。触碰可提升感知灵敏度。',
    },
    {
      file: '81',
      name: '福从之戒',
      desc: '米迦勒赐予的戒指。可以为了获得幸福而驱使魔神的物品。',
},
    {
      file: '82',
      name: '祓除棒(大幣)',
      desc: '用于驱赶伪多艾露(多艾露二世)的棒子。偽物は悪霊退散！',
    },
    {
      file: '83',
      name: '纸扇',
      desc: '敲打柴西卡的纸扇。敲得响亮会令人感到愉快。',
    },
    {
      file: '84',
      name: '刀',
      desc: '用于威胁雷依和柴西卡的玩具刀。即便被刺也不会受伤。',
    },
    {
      file: '85',
      name: '召唤师的手1',
      desc: '熟悉的召唤师手掌。或许能拿住些什么？',
    },
    {
      file: '86',
      name: '召唤师的手2',
      desc: '熟悉的召唤师手背。或许能握住些什么？',
    },
    {
      file: '87',
      name: '召唤师的手3',
      desc: '熟悉的召唤师手背。或许能搭配些什么？',
    },
    {
      file: '88',
      name: '召唤师的手4',
      desc: '熟悉的召唤师手背。佩戴福从之戒后所向披靡！',
    },
    {
      file: '89',
      name: '魔法杖',
      desc: '召唤师的普通法杖，这正是所谓的「弘法不必择笔」。',
    },
    {
      file: '90',
      name: '德比伦的邪眼',
      desc: '能抽取高涨的情感灵气，并让对方陷入懒散之中。',
    },
    {
      file: '91',
      name: 'BBB的邪口',
      desc: '连接着亚空间且能吞噬一切。没有味觉。',
    },
    {
      file: '92',
      name: '纳扎尔的邪眼',
      desc: '目光所及可植入嫉妒之心。',
    },
    {
      file: '93',
      name: '玛喵的邪眼',
      desc: '能扭曲所注视对象的认知。',
    },
    {
      file: '94',
      name: 'D・Red的邪口',
      desc: '能将目标缩小并收纳进体内。',
    },
    {
      file: '95',
      name: '哈德斯塔的邪眼',
      desc: '堕天后仍可洞察真相。上方之眼几乎浑浊而不可用。',
    },
    {
      file: '96',
      name: '库皮亚多艾露的真视之眼',
      desc: '拥有洞察真相的能力。',
    },
    {
      file: '97',
      name: '核',
      desc: '新宇宙的核心。',
    },
    {
      file: '98',
      name: '德比伦的颜文字：眼泪',
      desc: '德比伦的表情符号。用来表达悲伤时使用。',
    },
    {
      file: '99',
      name: '德比伦的颜文字：震惊',
      desc: '德比伦的表情符号。用来表达震惊时使用。',
    },
    {
      file: '100',
      name: '德比伦的颜文字：呕吐',
      desc: '德比伦的表情符号。用来表达恶心时使用。',
    },
    {
      file: '101',
      name: '猫的颜文字：爱心',
      desc: '阿尔玛斯的表情符号。撒狗粮时使用吧。',
    },
    {
      file: '102',
      name: '恶魔发箍',
      desc: '与德比伦的角同款。继兔耳与女仆发箍之后的新饰品！',
    },
    {
      file: '103',
      name: '德比伦贴纸',
      desc: '怠惰的恶魔，其真名为贝尔芬格。哒呀哒呀！',
    },
    {
      file: '104',
      name: '库皮亚多艾露贴纸',
      desc: '爱之天使。库啪～',
    },
    {
      file: '105',
      name: 'BBB贴纸',
      desc: '暴食的恶魔，其真名为别西卜。BBB！',
    },
    {
      file: '106',
      name: '阿莫阿莫贴纸',
      desc: '色欲的恶魔，其真名为阿斯莫德。唔谬！',
    },
    {
      file: '107',
      name: '纳扎尔贴纸',
      desc: '嫉妒的恶魔，其真名为利维坦。唔奴奴！',
    },
    {
      file: '108',
      name: '玛喵贴纸',
      desc: '贪婪的恶魔，其真名为玛门。唔喵喵！',
    },
    {
      file: '109',
      name: 'D・Red贴纸',
      desc: '愤怒的恶魔，其真名为撒旦。咕哈哈！',
    },
    {
      file: '110',
      name: '哈德斯塔贴纸',
      desc: '傲慢的堕天使，其真名为路西法。噜吓～',
    },
    {
      file: '111',
      name: '天纲',
      desc: '库皮亚多艾露使用的能力。用光环束缚对方',
    },
    {
      file: '112',
      name: '阴影',
      desc: '放在脸上可以制造阴影效果！',
    },
    {
      file: '113',
      name: '震惊',
      desc: '想让人物表达震惊状态时使用！',
    },
    {
      file: '114',
      name: '双心',
      desc: '想让人物表达超级心动时使用！',
    },
    {
      file: '115',
      name: '嘴巴（露牙笑）',
      desc: '推荐给召唤师使用！',
    },
    {
      file: '116',
      name: '嘴巴（三角）',
      desc: '推荐给召唤师使用！',
    },
    {
      file: '117',
      name: '嘴巴（微笑)',
      desc: '推荐给召唤师使用！',
    },
    {
      file: '118',
      name: '嘴巴（四角）',
      desc: '推荐给召唤师使用！',
    },
    {
      file: '119',
      name: '眼睛（死鱼眼）',
      desc: '通用的眼睛。推荐给召唤师使用！',
    },
    {
      file: '120',
      name: '眼睛（闭眼）',
      desc: '推荐给召唤师使用！缩小后可作为眉毛使用。',
    },
    {
      file: '121',
      name: '眼睛（瞪大）',
      desc: '推荐给召唤师使用',
    },
    {
      file: '122',
      name: '眼睛（睁开）',
      desc: '通用的眼睛。推荐给召唤师使用',
    },
    {
      file: '123',
      name: '石榴',
      desc: 'BBB喜欢的果实。这是人生第一次尝到的回忆味道。连着皮一起吃。',
    },
    {
      file: '124',
      name: '桃子',
      desc: '阿莫阿莫喜欢的水果。会在夜间泳池里饮用桃子冰沙。',
    },
    {
      file: '125',
      name: '蓝莓',
      desc: '纳扎尔喜欢的水果。来自德比伦的传授，是充满回忆的味道。',
    },
    {
      file: '126',
      name: '菠萝',
      desc: '玛喵最喜欢的水果。据说过去喜欢橘子。',
    },
    {
      file: '127',
      name: '辣椒',
      desc: 'D・Red喜欢的食物。虽然味觉迟钝，但能感受到些许刺激。',
    },
    {
      file: '128',
      name: '树莓',
      desc: '德比伦喜欢的水果。从下级恶魔时期就一路吃过来的怀念味道。',
    },
    {
      file: '129',
      name: '感叹号',
      desc: '想让人物表达惊讶状态时使用！',
    },
    {
      file: '130',
      name: '感叹问号',
      desc: '想营造惊讶氛围时使用！',
    },
    {
      file: '131',
      name: '得意符号',
      desc: '想让人物表达得意状态时使用！',
    },
    {
      file: '132',
      name: '手榴弾',
      desc: 'D・Red喜欢的武器。即便在近距离爆炸本人也安然无恙。',
    },
    {
      file: '133',
      name: '召唤师的手5',
      desc: '熟悉的召唤师手掌。用竖起的大拇指表示和大家心意相通！',
    },
  ],
  stickerFiles: function () {
    return this.stickerData().map(s => s.file + '.png')
  },
  sticker: function (file) {
    return this.stickerData().find(s => s.file == file)
  },
}
;(function () {
  const defaultSticker = [
    42, 43, 44, 45, 46, 47, 48, 113, 49, 50, 52, 53, 54, 55, 56, 57, 58, 59, 60,
    98, 99, 100, 101, 102, 61, 64, 114, 112, 129, 130, 131,
  ]
  console.log(TYRANO.kag.variable.sf.sticker)
  // ステッカー初期化
  if (!TYRANO.kag.variable.sf.sticker)
    TYRANO.kag.variable.sf.sticker = defaultSticker
  // すでにある場合、足りない初期ステッカーを追加する
  else
    TYRANO.kag.variable.sf.sticker = [
      ...TYRANO.kag.variable.sf.sticker,
      ...defaultSticker.filter(
        s => !TYRANO.kag.variable.sf.sticker.includes(s)
      ),
    ].filter(s => !(s instanceof Array))
})()
